InformationRegisters/ТелеграмЗначенияПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмЗначенияПараметров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТелеграмПараметры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЧатПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмЧатыПользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТелеграмПараметры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/ТелеграмПараметры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ТелеграмПараметры</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.ТелеграмЧатыПользователиПрисоединенныеФайлы</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>20</v8:Digits>
					<v8:FractionDigits>5</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/ТелеграмЗначенияПараметров/Ext/ManagerModule.bsl
Функция ЗначенияПараметров(ЧатПользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмПараметры.Родитель КАК Группа,
	|	ТелеграмПараметры.Код КАК Параметр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТелеграмЗначенияПараметров.Значение, НЕОПРЕДЕЛЕНО) = &ОбозначениеХранилища
	|			ТОГДА ТелеграмЗначенияПараметров.ХранилищеЗначения
	|		ИНАЧЕ ЕСТЬNULL(ТелеграмЗначенияПараметров.Значение, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.ТелеграмПараметры КАК ТелеграмПараметры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелеграмЗначенияПараметров КАК ТелеграмЗначенияПараметров
	|		ПО ТелеграмПараметры.Ссылка = ТелеграмЗначенияПараметров.Параметр
	|			И (ТелеграмЗначенияПараметров.ЧатПользователь = &ЧатПользователь)
	|			И (НЕ ТелеграмПараметры.ЭтоГруппа)
	|ГДЕ
	|	НЕ ТелеграмПараметры.ЭтоГруппа
	|	И НЕ ТелеграмПараметры.ПометкаУдаления
	|ИТОГИ ПО
	|	Группа ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ЧатПользователь", ЧатПользователь);
	Запрос.УстановитьПараметр("ОбозначениеХранилища", "ЗначениеВХранилищеЗначения");

	РезультатЗапроса = Запрос.Выполнить();
	
	Дерево = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
	ЗначенияПараметров = Новый Структура();	
	ОбработатьДеревоРекурсия(ЗначенияПараметров, Дерево);
	
	Возврат ЗначенияПараметров;
КонецФункции

Функция СоответствиеЗначенийПараметровПользователей(МассивСсылокПараметров) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграмЗначенияПараметров.ЧатПользователь КАК ЧатПользователь,
		|	ТелеграмЗначенияПараметров.Параметр КАК Параметр,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТелеграмЗначенияПараметров.Значение, НЕОПРЕДЕЛЕНО) = &ОбозначениеХранилища
		|			ТОГДА ТелеграмЗначенияПараметров.ХранилищеЗначения
		|		ИНАЧЕ ЕСТЬNULL(ТелеграмЗначенияПараметров.Значение, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК Значение
		|ИЗ
		|	РегистрСведений.ТелеграмЗначенияПараметров КАК ТелеграмЗначенияПараметров
		|ГДЕ
		|	ТелеграмЗначенияПараметров.Параметр В(&МассивСсылокПараметров)
		|ИТОГИ ПО
		|	ЧатПользователь ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("МассивСсылокПараметров", МассивСсылокПараметров);
	Запрос.УстановитьПараметр("ОбозначениеХранилища", "ЗначениеВХранилищеЗначения");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Дерево = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	МассивЗначенияПараметров = Новый Массив();
	
	Для каждого стрПользователь из Дерево.Строки Цикл
		ЗначенияПараметров = Новый Соответствие;	
		
		Для каждого стрПараметр из стрПользователь.Строки Цикл
			ЗначенияПараметров.Вставить(стрПараметр.Параметр,стрПараметр.Значение);	
		КонецЦикла;	
		
		ПараметрыПользователя = Новый Структура("Пользователь,ПараметрыПользователя",стрПользователь.ЧатПользователь,ЗначенияПараметров);
		МассивЗначенияПараметров.Добавить(ПараметрыПользователя);
	КонецЦикла;	
	
	Возврат МассивЗначенияПараметров;
	
КонецФункции

Процедура ОбработатьДеревоРекурсия(Структура, Дерево)

	Для каждого стр из Дерево.Строки Цикл		
		
		Если НЕ ЗначениеЗаполнено(стр.Группа) Тогда 
			РекурсивноеЗаполнениеСтруктуры(Структура,стр.Строки);			
			
		ИначеЕсли стр.Строки.Количество()>0 Тогда
			
			ТекущаяСтрока = Новый Структура();
			РекурсивноеЗаполнениеСтруктуры(ТекущаяСтрока,стр.Строки);
			Структура.Вставить(Строка(стр.Группа),ТекущаяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РекурсивноеЗаполнениеСтруктуры(ТекущаяСтруктура,Строки)
	
	Для Каждого стр из Строки Цикл 
		
		Если стр.Строки.Количество()>0 Тогда
			
			Если стр.Родитель <> Неопределено И
				стр.Группа = стр.Родитель.Группа Тогда
				
				Для Каждого стрТекущаяГруппа из стр.Строки Цикл
					ТекущаяСтруктура.Вставить(Строка(стрТекущаяГруппа.Параметр), стрТекущаяГруппа.Значение);
				КонецЦикла;
				Продолжить;	
			КонецЕсли;
			
			ТекущаяСтрока = Новый Структура();
			РекурсивноеЗаполнениеСтруктуры(ТекущаяСтрока,стр.Строки);
			ТекущаяСтруктура.Вставить(Строка(стр.Группа),ТекущаяСтрока);
			
		Иначе
			Значение = стр.Значение;
			Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
				Значение = Значение.Получить();
			КонецЕсли;
			ТекущаяСтруктура.Вставить(Строка(стр.Параметр),Значение);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОчиститьЗначения(Бот, ЧатПользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("ЧатПользователь", ЧатПользователь);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмЗначенияПараметров.ЧатПользователь,
	|	ТелеграмЗначенияПараметров.Параметр
	|ИЗ
	|	РегистрСведений.ТелеграмЗначенияПараметров КАК ТелеграмЗначенияПараметров
	|ГДЕ
	|	ТелеграмЗначенияПараметров.ЧатПользователь = &ЧатПользователь
	//|	И ТелеграмЗначенияПараметров.Параметр.Бот = &Бот
	|	И ТелеграмЗначенияПараметров.Параметр.ИсточникЗначения";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	МЗ = РегистрыСведений.ТелеграмЗначенияПараметров.СоздатьМенеджерЗаписи();
	Пока Выборка.Следующий() Цикл
		МЗ.ЧатПользователь = Выборка.ЧатПользователь;
		МЗ.Параметр = Выборка.Параметр;
		МЗ.Удалить();
	КонецЦикла;
	
КонецПроцедуры
